Catalogs/Нутриенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>Нутриенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНутриентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Растворимость</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Растворимость</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БиологическиеФункции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Нарушения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Нарушение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыНарушенийДисбалансаВитаминов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Симптом</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СимтомыНарушений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыНутриентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Enum>
		<Properties>
			<Name>ТипыНутриентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аминокислоты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Витамины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Жиры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минералы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Углеводы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МакроНутриенты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Растворимость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Enum>
		<Properties>
			<Name>Растворимость</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Жирорастворимый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Водорастворимый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Нутриенты/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьКоэффициентПересчетаМЕ_в_мкг(Нутриент) Экспорт
	
	Результат = 1;
	
	Если Нутриент = Справочники.Нутриенты.ВитаминD Тогда  		
		Результат = 0.0250;
	ИначеЕсли Нутриент = Справочники.Нутриенты.ВитаминE Тогда 
		Результат = 666.6667;
	ИначеЕсли Нутриент = Справочники.Нутриенты.ВитаминA Тогда 
		Результат = 0.3;
	ИначеЕсли Нутриент = Справочники.Нутриенты.ВитаминC Тогда 
		Результат = 50;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьРеквизитыПредопределенныхНутриентов() Экспорт 	
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Нутриенты.Ссылка КАК Нутриент
		|ИЗ
		|	Справочник.Нутриенты КАК Нутриенты
		|ГДЕ
		|	Нутриенты.Ссылка В ИЕРАРХИИ(&Аминокислоты)
		|	И НЕ Нутриенты.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Нутриенты.Ссылка КАК Нутриент
		|ИЗ
		|	Справочник.Нутриенты КАК Нутриенты
		|ГДЕ
		|	Нутриенты.Ссылка В ИЕРАРХИИ(&Витамины)
		|	И НЕ Нутриенты.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Нутриенты.Ссылка КАК Нутриент
		|ИЗ
		|	Справочник.Нутриенты КАК Нутриенты
		|ГДЕ
		|	Нутриенты.Ссылка В ИЕРАРХИИ(&Жиры)
		|	И НЕ Нутриенты.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Нутриенты.Ссылка КАК Нутриент
		|ИЗ
		|	Справочник.Нутриенты КАК Нутриенты
		|ГДЕ
		|	Нутриенты.Ссылка В ИЕРАРХИИ(&МакроНутриенты)
		|	И НЕ Нутриенты.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Нутриенты.Ссылка КАК Нутриент
		|ИЗ
		|	Справочник.Нутриенты КАК Нутриенты
		|ГДЕ
		|	Нутриенты.Ссылка В ИЕРАРХИИ(&Минералы)
		|	И НЕ Нутриенты.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Нутриенты.Ссылка КАК Нутриент
		|ИЗ
		|	Справочник.Нутриенты КАК Нутриенты
		|ГДЕ
		|	Нутриенты.Ссылка В ИЕРАРХИИ(&Углеводы)
		|	И НЕ Нутриенты.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Нутриенты.Ссылка КАК Нутриент
		|ИЗ
		|	Справочник.Нутриенты КАК Нутриенты
		|ГДЕ
		|	Нутриенты.Родитель = ЗНАЧЕНИЕ(Справочник.Нутриенты.ПустаяСсылка)
		|	И НЕ Нутриенты.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Аминокислоты", Справочники.Нутриенты.Аминокислоты);
	Запрос.УстановитьПараметр("Витамины", Справочники.Нутриенты.Витамины);
	Запрос.УстановитьПараметр("Жиры", Справочники.Нутриенты.Жиры_);
	Запрос.УстановитьПараметр("МакроНутриенты", Справочники.Нутриенты.МакроНутриенты);
	Запрос.УстановитьПараметр("Минералы", Справочники.Нутриенты.Минералы);
	Запрос.УстановитьПараметр("Углеводы", Справочники.Нутриенты.Углеводы_); 
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	СоответствиеТиповИНутриентов = Новый Соответствие;
	СоответствиеТиповИНутриентов.Вставить(Перечисления.ТипыНутриентов.Аминокислоты, РезультатЗапроса[0].Выбрать());
	СоответствиеТиповИНутриентов.Вставить(Перечисления.ТипыНутриентов.Витамины, РезультатЗапроса[1].Выбрать());
	СоответствиеТиповИНутриентов.Вставить(Перечисления.ТипыНутриентов.Жиры, РезультатЗапроса[2].Выбрать());
	СоответствиеТиповИНутриентов.Вставить(Перечисления.ТипыНутриентов.МакроНутриенты, РезультатЗапроса[3].Выбрать());
	СоответствиеТиповИНутриентов.Вставить(Перечисления.ТипыНутриентов.Минералы, РезультатЗапроса[4].Выбрать());
	СоответствиеТиповИНутриентов.Вставить(Перечисления.ТипыНутриентов.Углеводы, РезультатЗапроса[5].Выбрать());  	
	СоответствиеТиповИНутриентов.Вставить(Перечисления.ТипыНутриентов.Прочее, РезультатЗапроса[6].Выбрать());
	
	Для каждого Ит Из СоответствиеТиповИНутриентов Цикл
		
		ВыборкаДетальныеЗаписи = Ит.Значение;
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НутриентОбъект 		= ВыборкаДетальныеЗаписи.Нутриент.ПолучитьОбъект();
			НутриентОбъект.Тип 	= Ит.Ключ;
			
			Если Ит.Ключ = Перечисления.ТипыНутриентов.Витамины Тогда
				
				Если ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминB1 Тогда
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Водорастворимый;	
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминB10 Тогда
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Водорастворимый;		
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминB11 Тогда
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Водорастворимый;		
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминB12 Тогда
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Водорастворимый;		
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминB13 Тогда
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Водорастворимый;			
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминB15 Тогда
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Водорастворимый;				
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминB2 Тогда
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Водорастворимый;					
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминB3 Тогда
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Водорастворимый;						
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминB4 Тогда				
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Водорастворимый;	
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминB5 Тогда	
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Водорастворимый;	
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминB6 Тогда
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Водорастворимый;
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминB7 Тогда
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Водорастворимый;						
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминB8 Тогда				
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Водорастворимый;
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминB9 Тогда
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Водорастворимый;
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминC Тогда  
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Водорастворимый;
					
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминA Тогда
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Жирорастворимый;						
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминD Тогда				
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Жирорастворимый;
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминE Тогда
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Жирорастворимый;
				ИначеЕсли ВыборкаДетальныеЗаписи.Нутриент = Справочники.Нутриенты.ВитаминK Тогда  
					НутриентОбъект.Растворимость = Перечисления.Растворимость.Жирорастворимый; 					
			
				КонецЕсли; 	
				
			ИначеЕсли Ит.Ключ = Перечисления.ТипыНутриентов.Минералы Тогда
				
<<<<<<< HEAD
			ИначеЕсли Ит.Ключ = Перечисления.ТипыНутриентов.Аминокислоты Тогда	
=======
				
>>>>>>> 2600a984d7d3adb704c0252eb2b1f91d8def3007
				
			КонецЕсли; 
			
			НутриентОбъект.Записать();
			
		КонецЦикла;
		
	КонецЦикла; 		
		
КонецПроцедуры

#КонецОбласти
